In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_path = "index.csv"

In [3]:
df = pd.read_csv(data_path)

In [4]:
df.head()

,date,datetime,cash_type,card,money,coffee_name
0,2024-03-01,2024-03-01 10:15:50.520,card,ANON-0000-0000-0001,38.7,Latte
1,2024-03-01,2024-03-01 12:19:22.539,card,ANON-0000-0000-0002,38.7,Hot Chocolate
2,2024-03-01,2024-03-01 12:20:18.089,card,ANON-0000-0000-0002,38.7,Hot Chocolate
3,2024-03-01,2024-03-01 13:46:33.006,card,ANON-0000-0000-0003,28.9,Americano
4,2024-03-01,2024-03-01 13:48:14.626,card,ANON-0000-0000-0004,38.7,Latte

In [5]:
df.isnull().sum()

date            0
datetime        0
cash_type       0
card           89
money           0
coffee_name     0
dtype: int64

In [6]:
df.shape

(1133, 6)

In [7]:
df.dropna(inplace = True)

In [8]:
df['datetime'].dtype

dtype('O')

In [9]:
df['datetime'] = pd.to_datetime(df['datetime'])

In [10]:
df.drop('date', axis = 1, inplace = True)

In [11]:
df.head()

                 datetime cash_type                 card  money    coffee_name
0 2024-03-01 10:15:50.520      card  ANON-0000-0000-0001   38.7          Latte
1 2024-03-01 12:19:22.539      card  ANON-0000-0000-0002   38.7  Hot Chocolate
2 2024-03-01 12:20:18.089      card  ANON-0000-0000-0002   38.7  Hot Chocolate
3 2024-03-01 13:46:33.006      card  ANON-0000-0000-0003   28.9      Americano
4 2024-03-01 13:48:14.626      card  ANON-0000-0000-0004   38.7          Latte

In [12]:
df = df[['datetime','coffee_name','money','cash_type', 'card']]

In [13]:
df['cash_type'] = df['cash_type'].str.strip()

In [14]:
df['card'] = df['card'].str.strip()

In [15]:
df['coffee_name']=df['coffee_name'].str.strip()

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1044 entries, 0 to 1132
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   datetime     1044 non-null   datetime64[ns]
 1   coffee_name  1044 non-null   object
 2   money        1044 non-null   float64
 3   cash_type    1044 non-null   object
 4   card         1044 non-null   object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 48.9+ KB

In [17]:
df['money'].describe()

count    1044.000000
mean       32.876322
std         4.981218
min        18.120000
25%        28.900000
50%        32.820000
75%        37.720000
max        38.700000
Name: money, dtype: float64

In [18]:
df['datetime'].nunique()

1044

In [19]:
# now i realised that the date column was actually usefull to analyze how many orders we have recieved 
# in one day so we'll extract it from available column

In [20]:
df['datetime']= df['datetime'].astype(str)

In [21]:
df['date'] = df['datetime'].str.split(' ').str[0]

In [22]:
df['datetime'] = pd.to_datetime(df['datetime'])

In [23]:
df[df['datetime']=='2024-05-22 21:23:53']

,datetime,coffee_name,money,cash_type,card,date
563,2024-05-22 21:23:53,Hot Chocolate,37.72,card,ANON-0000-0000-0180,2024-05-22

In [24]:
df['datetime'].mode()[0]

Timestamp('2024-03-01 10:15:50.520000')

In [25]:
df.loc[563, 'datetime'] = '2024-05-22 21:23:53.520000'

In [26]:
df['datetime'] = pd.to_datetime(df['datetime'], errors='coerce')

In [27]:
df.groupby('date').count()

            datetime  coffee_name  money  cash_type  card
date
2024-03-01        11           11     11         11    11
2024-03-02         6            6      6          6     6
2024-03-03         9            9      9          9     9
2024-03-04         4            4      4          4     4
2024-03-05         9            9      9          9     9
...              ...          ...    ...        ...   ...
2024-07-27        13           13     13         13    13
2024-07-28         3            3      3          3     3
2024-07-29        11           11     11         11    11
2024-07-30        24           24     24         24    24
2024-07-31        22           22     22         22    22

[150 rows x 5 columns]

In [28]:
df.head()

,datetime,coffee_name,money,cash_type,card,date
0,2024-03-01 10:15:50.520,Latte,38.7,card,ANON-0000-0000-0001,2024-03-01
1,2024-03-01 12:19:22.539,Hot Chocolate,38.7,card,ANON-0000-0000-0002,2024-03-01
2,2024-03-01 12:20:18.089,Hot Chocolate,38.7,card,ANON-0000-0000-0002,2024-03-01
3,2024-03-01 13:46:33.006,Americano,28.9,card,ANON-0000-0000-0003,2024-03-01
4,2024-03-01 13:48:14.626,Latte,38.7,card,ANON-0000-0000-0004,2024-03-01

In [29]:
df = df[['date','datetime','coffee_name','money','cash_type', 'card']]

In [30]:
df.head()

,date,datetime,coffee_name,money,cash_type,card
0,2024-03-01,2024-03-01 10:15:50.520,Latte,38.7,card,ANON-0000-0000-0001
1,2024-03-01,2024-03-01 12:19:22.539,Hot Chocolate,38.7,card,ANON-0000-0000-0002
2,2024-03-01,2024-03-01 12:20:18.089,Hot Chocolate,38.7,card,ANON-0000-0000-0002
3,2024-03-01,2024-03-01 13:46:33.006,Americano,28.9,card,ANON-0000-0000-0003
4,2024-03-01,2024-03-01 13:48:14.626,Latte,38.7,card,ANON-0000-0000-0004

In [31]:
df['coffee_name'].unique()

array(['Latte', 'Hot Chocolate', 'Americano', 'Americano with Milk',
       'Cocoa', 'Cortado', 'Espresso', 'Cappuccino'], dtype=object)

In [32]:
df['cash_type'].unique()

array(['card'], dtype=object)

In [33]:
#if all the payments are done by card then it is better to drop this column as it will not help to gain any insights
# its clear everyone uses card

In [34]:
df.drop('cash_type',axis= 1,inplace =True)

In [35]:
df['card'].nunique()

446

In [36]:
df.head()

,date,datetime,coffee_name,money,card
0,2024-03-01,2024-03-01 10:15:50.520,Latte,38.7,ANON-0000-0000-0001
1,2024-03-01,2024-03-01 12:19:22.539,Hot Chocolate,38.7,ANON-0000-0000-0002
2,2024-03-01,2024-03-01 12:20:18.089,Hot Chocolate,38.7,ANON-0000-0000-0002
3,2024-03-01,2024-03-01 13:46:33.006,Americano,28.9,ANON-0000-0000-0003
4,2024-03-01,2024-03-01 13:48:14.626,Latte,38.7,ANON-0000-0000-0004

In [37]:
# here i wanted to drop card column as well but then i realise i can use it to check how many customer came back
# lets try to solve some eda on tableau to make dashboard.

In [38]:
df.to_csv('coffee.csv', index = False)